# -*- coding:cp1252 -*-
#Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]. 
#Необходимо вывести элементы, которые одновременно 1) меньше 30 и 2) делятся на 3 без остатка. 
#Все остальные элементы списка необходимо просуммировать и вывести конечный результат.
NUM = 30
DIV_NUM = 3

lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
sum = 0
for i in lst:
    if (i < NUM and i % DIV_NUM == 0):
        print(i, end =", ")
    else:
        sum += i
        
print("sum =",sum)

